--- 1. Таблицы и данные в SQL
--- Работа с таблицами (CREATE/ALTER/DROP TABLE)
--- Вставка и изменение данных (INSERT/UPDATE/DELETE)


--- 2. Запросы к данным
--- Запрос данных (SELECT/FROM/WHERE/ORDER BY/LIMIT
--- Объединение данных из несколько таблиц JOIN
--- Группировки (GROUP BY / HAVING)
--- Подзапросы
--- Представления (VIEW)


--- 3. Функции систем управления базами данных
--- Согласованность данных в базе: транзакции и ограничения
--- Повышение производительности запросов: индексы


--- Что дальше ?

--- Возможности SQL
--- Общие таличные выражения - COMMON TABLE EXPRESSIONS
--- Оконные функции
--- Иерархические и ресурсивные запросы
--- Функции работы с датами / строками и.т.д


--- Проектирование баз данных
--- Реляционная теория/нормальные формы
--- Проектирование схемы базы данных


--- Системы управления базами данных
--- Внутреннее устройство/администрирование
--- Оптимизация производитеьности/Большие объемы данных


--- Практика SQL
--- Плейлист с разбором практических заданий
--- Тренажеры SQL: leetcode.com, sql-ex.ru, sql-academy.org
--- Задачи из вашей работы/учебы


--- SQL в вашей рабочей среде
--- SQL в языках программирования (PHP, Python, Java, Javascript ит.д)
--- SQL Frameworks
--- ORM (Object-Relational Mapping)
--- SQL в инструментах аналитики (Tableau, Power BI, Excel и др)


--- Средства SQL для предметной области
--- Аналитики - оконные функции